as21253679/nrf51822/ble_app_uart_3adc_eeprom_button_8bit/main.c
    // Configure ADC
	if(adc_number==5)
	{
		NRF_ADC->CONFIG     = (ADC_CONFIG_RES_8bit                        << ADC_CONFIG_RES_Pos)     |						//8bit adc_conversion
							  (ADC_CONFIG_INPSEL_AnalogInputOneThirdPrescaling << ADC_CONFIG_INPSEL_Pos)  |					//simulate pin input 1/3v
							  (ADC_CONFIG_REFSEL_VBG    << ADC_CONFIG_REFSEL_Pos)  |										//refer 1.2 voltage
							  (ADC_CONFIG_PSEL_AnalogInput5                  << ADC_CONFIG_PSEL_Pos)    |					//select adc 
							  (ADC_CONFIG_EXTREFSEL_None                  << ADC_CONFIG_EXTREFSEL_Pos);						//without external refer voltage
	}
	else if(adc_number==6)
	{
		NRF_ADC->CONFIG     = (ADC_CONFIG_RES_8bit                        << ADC_CONFIG_RES_Pos)     |						//8bit adc_conversion
							  (ADC_CONFIG_INPSEL_AnalogInputOneThirdPrescaling << ADC_CONFIG_INPSEL_Pos)  |					//simulate pin input 1/3v
							  (ADC_CONFIG_REFSEL_VBG    << ADC_CONFIG_REFSEL_Pos)  |										//refer 1.2 voltage
							  (ADC_CONFIG_PSEL_AnalogInput6                  << ADC_CONFIG_PSEL_Pos)    |					//select adc 
							  (ADC_CONFIG_EXTREFSEL_None                  << ADC_CONFIG_EXTREFSEL_Pos);						//without external refer voltage
	}
	else if(adc_number==7)
	{
		NRF_ADC->CONFIG     = (ADC_CONFIG_RES_8bit                        << ADC_CONFIG_RES_Pos)     |						//8bit adc_conversion
							  (ADC_CONFIG_INPSEL_AnalogInputOneThirdPrescaling << ADC_CONFIG_INPSEL_Pos)  |					//simulate pin input 1/3v
							  (ADC_CONFIG_REFSEL_VBG    << ADC_CONFIG_REFSEL_Pos)  |										//refer 1.2 voltage
							  (ADC_CONFIG_PSEL_AnalogInput7                  << ADC_CONFIG_PSEL_Pos)    |					//select adc 
							  (ADC_CONFIG_EXTREFSEL_None                  << ADC_CONFIG_EXTREFSEL_Pos);						//without external refer voltage
	}
	else
		return 0;
	
	NRF_ADC->INTENSET   = ADC_INTENSET_END_Msk;
    NRF_ADC->EVENTS_END = 0;
    NRF_ADC->ENABLE     = ADC_ENABLE_ENABLE_Enabled;
 
    // Enable ADC interrupt
    err_code = sd_nvic_ClearPendingIRQ(ADC_IRQn);
    APP_ERROR_CHECK(err_code);
 
    err_code = sd_nvic_SetPriority(ADC_IRQn, 3);
    APP_ERROR_CHECK(err_code);
                     
  	err_code =sd_nvic_DisableIRQ(ADC_IRQn);
   // err_code = sd_nvic_EnableIRQ(ADC_IRQn);
    APP_ERROR_CHECK(err_code);
 
    NRF_ADC->EVENTS_END  = 0;    // Stop any running conversions.
    NRF_ADC->TASKS_START = 1;
	while (NRF_ADC->EVENTS_END == 0 || times >200 )
    {
		times ++ ;
	}     
	if(times > 200)
	{
		return 0;
	}
	else
	{
		NRF_ADC->EVENTS_END     = 0;
		adc_result              = NRF_ADC->RESULT;
		NRF_ADC->TASKS_STOP     = 1;
	}
    return adc_result;   
}

/**
 * @brief set adc_pin nopull input. 
 */
static void adc_pin_config(void)
{
	nrf_gpio_cfg_input(4, NRF_GPIO_PIN_NOPULL);
	nrf_gpio_cfg_input(5, NRF_GPIO_PIN_NOPULL);
	nrf_gpio_cfg_input(6, NRF_GPIO_PIN_NOPULL);
}

/**
 * @brief Function button change active mode.
 */
void button_active(void)
{
	int i=0;
	
	if(nrf_gpio_pin_read(12))
	{
		nrf_gpio_pin_clear(8);
		for(i=0;i<2000;i++)
		{
			if(nrf_gpio_pin_read(12))
			{
				bt_count++;
				if(bt_count==4)
					bt_count=0;
				
				nrf_gpio_pin_clear(14);
				nrf_gpio_pin_clear(13);
				nrf_gpio_pin_clear(10);
				nrf_gpio_pin_clear(7);
				
				switch (bt_count)
				{
					case 0:
						nrf_gpio_pin_set(14);break;
					case 1:
						nrf_gpio_pin_set(13);break;
					case 2:
						nrf_gpio_pin_set(10);break;
					case 3:
						nrf_gpio_pin_set(7);break;
				}
				nrf_delay_ms(500);
				i=0;
			}
			nrf_delay_ms(1);
		}
		nrf_gpio_pin_set(8);
	}
}

void led_gpio_init(void)
{
	nrf_gpio_cfg_output(14);//standby mode
	nrf_gpio_cfg_output(13);//earse mode
	nrf_gpio_cfg_output(10);//write mode
	nrf_gpio_cfg_output(7); //read mode
	nrf_gpio_cfg_output(8); //work led
	
	nrf_gpio_pin_set(14);
	nrf_gpio_pin_clear(13);
	nrf_gpio_pin_clear(10);
	nrf_gpio_pin_clear(7);
	nrf_gpio_pin_set(8);
}

void write_mode(void)
{
	uint8_t adc_string[50]="";
	uint8_t adc1,adc2,adc3;
	uint8_t reg_byte_H=0x00,reg_byte_L=0x00;
	bool max_bit=false;
	
	while(1)//wait UV_value is detected
	{
		if(nrf_gpio_pin_read(12))
			break;
		
		adc3=adc_start(7);//manually trigger adc
		if(adc3>=0)
			break;
	}
	
	max_bit=false;reg_byte_H=0x00,reg_byte_L=0x00;
	while(1)
	{
		if(nrf_gpio_pin_read(12))
			break;
		
		adc1=adc_start(5);//manually trigger adc
		adc2=adc_start(6);//manually trigger adc
		adc3=adc_start(7);//manually trigger adc
		
		write_EEPROM_data(reg_byte_H,reg_byte_L,adc1,adc2,adc3,max_bit);//write data to eeprom
		nrf_delay_ms(5);//I2C delay 5ms
		if(reg_byte_H==0xFF)//upper_counter for eeprom_address
		{
			if(max_bit==true)
				break;
			max_bit=true;
			reg_byte_H=0x00;
			reg_byte_L=0x00;
		}
		else
		{
			if(reg_byte_L==0xFC)
			{
				reg_byte_H+=0x01;
				reg_byte_L=0x00;
			}
			else
			{
				reg_byte_L+=0x03;
			}
		}
		
		printf("ADC5:%d %X\r\n",adc1,adc1);
		sprintf(adc_string,"1:%d\n",adc1);
		printf("ADC6:%d %X\r\n",adc2,adc2);
		sprintf(adc_string,"%s2:%d\n",adc_string,adc2);
		printf("ADC7:%d %X\r\n",adc3,adc3);
		sprintf(adc_string,"%s3:%d\n",adc_string,adc3);
		printf("\r\n");
		
		ble_nus_string_send(&m_nus, adc_string, 20);//send data through ble uart
		nrf_delay_ms(500);
    }
}

void read_mode(void)
{
	int i;
	uint8_t reg_byte_H=0x00;
	bool max_bit=false;
	uint8_t m_data[255]; //Buffer for read EEPROM data. 
	
	max_bit=false;reg_byte_H=0x00;
	
	while(1)
	{
		if(nrf_gpio_pin_read(12))
			break;
		
		read_EEPROM_data(reg_byte_H,0x00,max_bit,m_data);//read eeprom data in specific register
		for(i=0;i<12;i++)//send eeprom_data, max_size of ble_send_data is 20byte 
		{
			ble_nus_string_send(&m_nus, &m_data[i*20], 20);//send data through ble uart
		}
		if(reg_byte_H==0xFF)//upper_counter for eeprom_address
		{
			if(max_bit==true)
				break;
			max_bit=true;
			reg_byte_H=0x00;
		}
		else
		{
			reg_byte_H+=0x01;
		}
	}
}

/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
	led_gpio_init();//led_pin config
	adc_pin_config();//adc_pin config
	nrf_gpio_cfg_input(12,NRF_GPIO_PIN_PULLDOWN);  //button config p0.12
	
	// eeprom init
	twi_init();//i2c init
	
    // Initialize ble.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    uart_init();
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
    printf("\r\nUART Start!\r\n");
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
	
	while(1)
	{
		button_active();
		switch(bt_count)
		{
			case 0:
				printf("\r\nStandby mode\r\n");
				nrf_gpio_pin_set(14);
				power_manage();//low power state
				break;
			case 1:
				printf("\r\nwErase mode\r\n");
				ERASE_EEPROM_data();
				nrf_gpio_pin_clear(13);
				bt_count=0;
				break;
			case 2:
				printf("\r\nWrite mode\r\n");
				write_mode();
				nrf_gpio_pin_clear(10);
				bt_count=0;
				break;
			case 3:
				printf("\r\nRead mode\r\n");
				read_mode();
				nrf_gpio_pin_clear(7);
				bt_count=0;
				break;
		}
		nrf_delay_ms(100);
	}
}
